Repository: al1yew/Mashinin
Catalog: Mashinin/Resources/Localization/SharedResource.*.resx
Languages: az, ru

# adTypeRequired
source: Ad type is required.
az: Elan tipini seçin.
ru: Выберите тип объявления.

# bodyTypeMore0
source: Body type selected wrong.
az: Ban növü səhv qeyd olunub.
ru: Тип кузова указан неверно.

# bodyTypeRequired
source: Body type is required.
az: Ban növünü qeyd edin.
ru: Укажите тип кузова.

# cityExists
source: City exists with NameAz="{0}", or NameRu="{1}", or NameEn="{2}".
az: NameAz="{0}", və ya NameRu="{1}", və ya NameEn="{2}" olan şəhər mövcuddur.
ru: Город существует или с NameAz="{0}", или с NameRu="{1}", или с NameEn="{2}".

# cityNotFound
source: City is not found.
az: Şəhər tapılmadı.
ru: Город не найден.

# cityRequired
source: City is required.
az: Şəhəri seçin.
ru: Выберите город.

# colorExists
source: Color exists with NameAz="{0}", or NameRu="{1}", or NameEn="{2}", or HexCode="{3}".
az: NameAz="{0}", və ya NameRu="{1}", və ya NameEn="{2}", və ya HexCode="{3}" olan rənq mövcuddur.
ru: Цвет существует или с NameAz="{0}", или с NameRu="{1}", или с NameEn="{2}", или с HexCode="{3}".

# colorNotFound
source: Color is not found.
az: Rənq tapılmadı.
ru: Цвет не найден.

# colorRequired
source: Color is required.
az: Rəngi seçin.
ru: Выберите цвет.

# currencyRequired
source: Currency is required.
az: Valyutani seçin.
ru: Выберите валюту.

# descriptionMaxLength
source: Description must be 2048 chars at most.
az: Əlavə məlumat 2048 hərfdən çox olmamalıdır.
ru: Описание должно быть короче 2048 символов.

# descriptionRequired
source: Description is required.
az: Əlavə məlumat qeyd edin.
ru: Укажите описание.

# drivingWheelsMore0
source: Driving wheels selected wrong.
az: Ötürücü təkərlər səhv qeyd olunub.
ru: Ведущие колеса указаны неверно.

# drivingWheelsRequired
source: Driving wheels are required.
az: Ötürücü təkərləri qeyd edin.
ru: Укажите ведущие колеса.

# enginePowerMore0
source: Engine power entered wrong.
az: Motorun gücü səhv qeyd olunub.
ru: Мощность двигателя указана неверно.

# enginePowerRequired
source: Engine power is required.
az: Motorun gücünü qeyd edin.
ru: Укажите мощность двигателя.

# engineVolumeMore0
source: Engine volume entered wrong.
az: Motorun həcmi səhv qeyd olunub.
ru: Объем двигателя указан неверно.

# engineVolumeRequired
source: Engine volume is required.
az: Motorun həcmini qeyd edin.
ru: Укажите объем двигателя.

# exporterCountryMore0
source: Export country selected wrong.
az: Eksport ölkəsi səhv qeyd olunub.
ru: Страна экспорта выбрана неверно.

# exporterCountryRequired
source: Export country is required.
az: Eksport ölkəsini qeyd edin.
ru: Укажите страну экспорта.

# frontPhotoRequired
source: Front image is required.
az: Qabaq şəkili əlavə edin.
ru: Добавьте фото спереди.

# fuelTypeMore0
source: Fuel type entered wrong.
az: Yanacaq növü səhv qeyd olunub.
ru: Тип топлива выбран неверно.

# fuelTypeRequired
source: Fuel type is required.
az: Yanacaq növünü qeyd edin.
ru: Укажите тип топлива.

# gasHasCylinder
source: If works with Gas, then has Gas cylinder
az: Qaznan işləyirsə, qaz balonu mövcud olmalıdır.
ru: Если работает на газе, то должен быть балон.

# hexCodeNotMatchFormat
source: Invalid hex color code format.
az: HexCode lazım olan formata uyğun deyil.
ru: HexCode не соответствует нужному формату.

# indexMustBeNumber
source: Index must be a number.
az: Index rəqəm olmalıdır.
ru: Index должен быть числом.

# makeExists
source: Make exists with Name="{0}" or TurboAzId="{1}".
az: Adı "{0}" və ya TurboAzId="{1}" olan marka mövcuddur.
ru: Марка существует или с именем "{0}", или с TurboAzId="{1}".

# makeNotFound
source: Make is not found.
az: Marka tapılmadı.
ru: Марка не найдена.

# makeRequired
source: Make is required.
az: Markanı seçin.
ru: Выберите марку.

# maxMoreMin
source: Minimum win price must be less than maximum.
az: Alt uduş qiyməti üst uduş qiymətindən az olmalıdır.
ru: Нижняя планка цены должна быть меньше верхней.

# modelExists
source: Model exists with Name="{0}", or TurboAzId="{1}", or MakeId="{2}".
az: Adı "{0}", və ya TurboAzId="{1}", və ya MakeId="{2}" olan model mövcuddur.
ru: Модель существует или с именем "{0}", или с TurboAzId="{1}", или с MakeId="{2}".

# modelNotFound
source: Model is not found.
az: Model tapılmadı.
ru: Модель не найдена.

# modelRequired
source: Model is required.
az: Modeli seçin.
ru: Выберите модель.

# nameRequired
source: Name is required.
az: Adı qeyd edin.
ru: Укажите название.

# numberPlateExists
source: Number plate "{0}" exists.
az: "{0}" Nömrəsi artıq mövcuddur.
ru: Номер "{0}" уже существует.

# numberPlateFalseFormat
source: Number plate is in wrong format.
az: Nömrə səhv formatdadır.
ru: Номер не соответствует формату.

# numberPlateNotFound
source: Number plate is not found.
az: Nömrə tapılmadı.
ru: Номер не найден.

# numberPlateRequired
source: Number plate is required.
az: Nömrəni qeyd edin.
ru: Укажите номер.

# objectIsNull
source: Sent object is null.
az: Göndərilən məlumatlar səhvdir.
ru: Данные отсутствуют.

# odometerMore0
source: Odometer must be positive.
az: Odometr pozitiv olmalıdır.
ru: Пробег не может быть отрицательным.

# odometerRequired
source: Odometer is required.
az: Odometr qeyd edin.
ru: Укажите пробег.

# periodOfTimeLess30
source: Time span must be at most 30 days.
az: Gün sayı çoxu 30 olmalıdır.
ru: Количество дней не может быть больше 30.

# periodOfTimeMore1
source: Time span must be at least 1 day.
az: Gün sayı azı 1 olmalıdır.
ru: Количество дней не может быть меньше 1.

# periodOfTimeRequired
source: Time span is required.
az: Qiymətin neçə günə aid olduğunu qeyd edin.
ru: Укажите количество дней для указанной цены.

# personPlacesCountMore0
source: Places count entered wrong.
az: Yer sayı səhv qeyd olunub.
ru: Количество мест указано неверно.

# personPlacesCountRequired
source: Places count is required.
az: Yer sayını qeyd edin.
ru: Укажите количество мест.

# photosRequired
source: Photos are required.
az: Şəkilləri əlavə edin.
ru: Добавьте фотографии.

# placesForMoto
source: Motorcycle can have 3 seats at most.
az: Motosikl 3-dən çox yerə sahib ola bilməz.
ru: Мотоцикл имеет максимум 3 места.

# priceForRepairMore0
source: Price for repair must be non-negative.
az: Düzəliş qiyməti negativ ola bilməz.
ru: Цена за починку должна быть неотрицательной.

# priceForRepairRequired
source: Price for repair required as the car is damaged.
az: Vurulmuş maşın üçün düzəliş qiyməti qeyd olunmalidir.
ru: Для битой машины важно указать цену за починку.

# priceRequired
source: Price is required.
az: Qiyməti qeyd edin.
ru: Укажите цену.

# rearPhotoRequired
source: Rear image is required.
az: Arxa şəkili əlavə edin.
ru: Добавьте фото сзади.

# required
source: is required.
az: qeyd edin.
ru: отсутствует.

# transmissionTypeMore0
source: Transmission type selected wrong.
az: Sürətlər qutusu səhv qeyd olunub.
ru: Тип трансмиссии указан неверно.

# transmissionTypeRequired
source: Transmission type is required.
az: Sürətlər qutusunu qeyd edin.
ru: Укажите тип трансмиссии.

# transportationPriceRequired
source: Transportation costs are required.
az: Daşınma xərclərini qeyd edin.
ru: Введите сумму затрат на перевоз.

# transportNotFound
source: Car is not found.
az: Maşın tapılmadı.
ru: Автомобиль не найден.

# validityRequired
source: Validity time span is required.
az: Tarixi qeyd edin.
ru: Укажите действительные даты.

# vinLength
source: Vin code must be 17 symbols length.
az: Vin kod 17 simvoldan ibarət olmalıdır.
ru: Vin код должен быть 17 символов в длину.

# vinMatches
source: Vin code format is wrong.
az: Vin kodun formatı səhvdir.
ru: Формат Vin кода неверный.

# vinRequired
source: Vin code is required.
az: Vin kodu qeyd edin.
ru: Укажите Vin код.

# winPriceMaxRequired
source: Maximum winning price is required.
az: Uduş qiymətinin üst ehtimalini qeyd edin.
ru: Укажите верхнюю планку ценового диапазона.

# winPriceMinRequired
source: Minimum winning price is required.
az: Uduş qiymətinin alt ehtimalini qeyd edin.
ru: Укажите нижнюю планку ценового диапазона.

# winPricesMore0
source: Prices must be non-negative.
az: Uduş qiymətləri negativ olmamalıdır.
ru: Диапазон цен не может быть отрицательным.

# yearLess1900
source: Year must be after 1900.
az: İl 1900-dan sonra olmalıdır.
ru: Выберите год после 1900-ого.

# yearMoreToday
source: Year cannot be after current year.
az: İl hazırki ildən artıq ola bilməz.
ru: Выберите год до нынешнего включительно.

# yearRequired
source: Year is required.
az: İl seçin.
ru: Выберите год.
