{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "AllowedHosts": "*",
  "ConnectionStrings": {
    //"Default": "Server = DESKTOP-MI8PHLR; Database = Mashinin; Trusted_Connection = true; Encrypt = False",
    "Default": "Data Source=SQL6030.site4now.net;Initial Catalog=db_aa1eed_mashinindummy;User Id=db_aa1eed_mashinindummy_admin;Password=Vasif100",

  }
}

//a mojet voobshe sdelat kak socialnuyu set? pust saloni/ludi/alverciler publikuyut foto i video
//toqda nujno budet sdelat ne blog, a social nebilim ne
//eto lucse chem blog ved blog mi vikladivayem tolko sami, a tut ludi sami smogut vikladivat i podpisivatsa
//toqda u kajdogo usera budet insta fb yt tiktok link ukazan, shto b mogli delitsa i vikladivat posti ottuda tipa

//mojet isLoading v fronte sdelat vnutri contexta? takim obrazom u mena budet vseqo odna stroka...

//otkrit car marketplace sayti, vzat A4 list, vipisat vse props dla transport kotorie u mena est, stavit plusi i minusi pered kajdim
//tipa Name + + - + gde kajdiy iz nix eto sayt, turbo az, mashinal, otomoto, autoscout, zad 
//tak ya poymu shto kak dobavit, ubrat, mojet shto to nenujno

//transport dobavlen, nado teper delat CRUD i vse metodi!!! proverit eqo!!!

//get actionunu edende, viewcount++ olsun hamisinda

//sozdat usera, tipi userov i ix roli, kuda im mojno zaxodit a kuda net, login/register, sozdat vse ego relationi so vsemi druqimi entity

//nado umet sozdavat randomnie kollekcii dla main page, tipa avto dla pojilix, dla molodix, do 5000, itd. ix nado umet sosstavlat iz adminki, 
//ya doljen budu soxranat filtraciyu, shto b user mog i sam dobavit filtracii vsakie posle togo kak zaydet v kategoriyu
//user budet soxranat kategorii kak poiski
//user doljen imet wishlist zapcastey, tachek, nomerov. poetomu v WishlistItem budet userId, i Type obazatelno
//user budet imet wishlist, reports, saved searches (tam je i kategorii budut dobavlatsa, mojno daje odin Class 
//sozdat dla etoqo, prosto sdelat IsFromAdminPanel = true dla moix, i fotosu olsun tipa), cars (dobavlennie im samim),
//toqda isFromAdminPanel budut kategorii, a te kotorie false - butut ego sobstevnnie searches.
//nado eshe umet soxranat tam kolvo values. koqda user dobavlayet, budem schitat skolko results count
//kajdiy raz koqda on budet otkrivat svoi saved searches ili saved kategorii, budem otpravlat emu noviy count, 
//i sravnivat s predidushim countrom

//eshe est sayti s vidosami o pochinke avto, spizdit vidosi s etix saytov :D 

//nomera telefonov budem pratat v fronte. ustune basanda budem fetch delat prosto iz api
//a to u mena spizdat kak ya s turbo aza hahaha

//a mojet sdelat chat mentigi? comment-reply mentigi? pod kajdim obyavleniem

//budem pisat vsem salonam, shto bizim saytda bu link ile registraciyadan kecin, salonun sehifesin acin, 1 aylig pulsuz vip alin
//to je samoe koqda soberem nomera userov s turbo aza, i to je samoe instagramda alverci shirketlere yazmag nado

//tutorial page
//api satmag carfax zad

//vehicle valuation page - user vpishet dannie svoyey mashini, a mi yeyo ocenim, nado pridumat algoritm - vot tut to i nujen budet skraping! 
//budet vibirat vsakie values, mi budem kidat v turbo az, i ocenivat ego mashinu, davat emu xoroshuyu infu

//vnimatelno smotri google doc mashin.in shared s arvad, tam poleznie punkti

//vse nado tshatelno proverit, kak ya vse napisal sdes... posprashivat u chat gpt, sdelat konfetku iz proekta

//turbo az dobavil novie modeli, dla forda naprimer, fusion i focus North America zad. mne nado ispravit eto v databaze...
//nado voobshe privezti vse values iz databazi i sverit s temi shto est u turbo aza. nado napisat dla etogo method...

//postaratsa bit luchse. repository nado vozvrashat ne list, a iqueryable. potom v Service mojno prevrashat ego v List. 
//takim obrazom budet performance. a eshe nado ispolzovat icollection, ienumerable, i druqie veshi.
//posmotri NEC. COllection types in .net - v chatgpt est chat

//mojet dobavit TransmissionType v ExtractedNumbers, ili v dr table? Eto mojet povliyat na statistiku... 
//Xota u nas v strane ne tak mnogo mexaniki


//accessories
/*
        Interior Accessories:

        Floor mats
        Seat covers
        Steering wheel covers
        Dashboard covers
        Sunshades
        Organizer trays and bins
        Interior lighting kits
        Car fragrances

        Exterior Accessories:

        Car covers
        Spoilers and body kits
        Roof racks and cargo carriers
        Mudguards and splash guards
        Wind deflectors
        License plate frames
        Exterior trim and accents
        Decals and stickers

        Electronics and Gadgets:

        Dash cams
        GPS navigation systems
        Bluetooth adapters
        USB chargers and power outlets
        Car alarms and security systems
        Parking sensors and cameras
        Remote starters

        Performance Parts:

        Exhaust systems
        Air filters
        Suspension upgrades
        Brake pads and rotors
        Engine tuning chips
        Turbochargers and superchargers
        Performance tires and wheels

        Maintenance and Care Products:

        Car cleaning kits
        Wax and polish
        Tire cleaners and dressings
        Interior cleaners and protectants
        Engine additives and fluids
        Battery chargers and maintainers
        Oil and lubricants

        Safety and Emergency Equipment:

        First aid kits
        Emergency roadside kits
        Reflective triangles and vests
        Fire extinguishers
        Tire repair kits
        Jumper cables
        Portable jump starters

        Comfort and Convenience Items:

        Cup holders and organizers
        Armrests and console organizers
        Seat cushions and lumbar supports
        Heated blankets and seat cushions
        Portable air compressors
        Portable coolers and warmers
         */



//chemicals
/*

        Car wash shampoo
        Interior cleaner
        Glass cleaner
        Wheel cleaner
        Tire cleaner
        Engine degreaser

        Lubricants (e.g., WD-40)
        Rust inhibitors
        Brake cleaner
        Fuel additives (e.g., fuel system cleaners)
        Antifreeze/coolant
        Oil additives

        Wax and polish
        Paint sealants
        Clay bars
        Quick detailers
        Trim restorers
        Leather conditioners

        Headlight restoration kits
        Scratch removers
        Odor eliminators
        Windshield treatments
        Convertible top cleaners/protectants
        Tar and bug removers
         */
